# FamilyAllowCutWithVoids Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyAllowCutWithVoids Property
ParameterTypeId Class See Also
---
"Cut with Voids When Loaded"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyAllowCutWithVoids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyAllowCutWithVoids As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyAllowCutWithVoids {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace